IRP/src/Documents/Payroll/Payroll.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
 <name>Payroll</name>
 <registerRecords>AccumulationRegister.R5022T_Expenses</registerRecords>
 <registerRecords>AccumulationRegister.R9555T_PaidSickLeaves</registerRecords>
 <registerRecords>AccumulationRegister.R3027B_EmployeeCashAdvance</registerRecords>
 <registerRecords>AccumulationRegister.R9545T_PaidVacations</registerRecords>
 <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
 <registerRecords>AccumulationRegister.R5020B_PartnersBalance</registerRecords>
 <registerRecords>AccumulationRegister.R9510B_SalaryPayment</registerRecords>
 <registerRecords>AccumulationRegister.R5021T_Revenues</registerRecords>
 <registerRecords>AccumulationRegister.T1040T_AccountingAmounts</registerRecords>
 <registerRecords>AccumulationRegister.R5015B_OtherPartnersTransactions</registerRecords>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </attributes>
 <attributes>
  <name>BeginDate</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>EndDate</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>PaymentPeriod</name>
  <type>
   <types>CatalogRef.PlanningPeriods</types>
  </type>
 </attributes>
 <attributes>
  <name>DELETE_CalculationType</name>
  <type>
   <types>CatalogRef.SalaryCalculationType</types>
  </type>
 </attributes>
 <attributes>
  <name>DELETE_Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>DELETE_LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>DELETE_Agreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AccrualList</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Employee</name>
   <type>
    <types>CatalogRef.Partners</types>
   </type>
  </attributes>
  <attributes>
   <name>Position</name>
   <type>
    <types>CatalogRef.EmployeePositions</types>
   </type>
  </attributes>
  <attributes>
   <name>AccrualType</name>
   <type>
    <types>CatalogRef.AccrualAndDeductionTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ExpenseType</name>
   <type>
    <types>CatalogRef.ExpenseAndRevenueTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ProfitLossCenter</name>
   <type>
    <types>CatalogRef.BusinessUnits</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>TotalVacationDays</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>3</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>PaidVacationDays</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>3</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>TotalSickLeaveDays</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>3</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>PaidSickLeaveDays</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>3</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>CalculationType</name>
   <type>
    <types>CatalogRef.SalaryCalculationType</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>DeductionList</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Employee</name>
   <type>
    <types>CatalogRef.Partners</types>
   </type>
  </attributes>
  <attributes>
   <name>Position</name>
   <type>
    <types>CatalogRef.EmployeePositions</types>
   </type>
  </attributes>
  <attributes>
   <name>DeductionType</name>
   <type>
    <types>CatalogRef.AccrualAndDeductionTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ExpenseType</name>
   <type>
    <types>CatalogRef.ExpenseAndRevenueTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ProfitLossCenter</name>
   <type>
    <types>CatalogRef.BusinessUnits</types>
   </type>
  </attributes>
  <attributes>
   <name>IsRevenue</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>CalculationType</name>
   <type>
    <types>CatalogRef.SalaryCalculationType</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>CashAdvanceDeductionList</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Employee</name>
   <type>
    <types>CatalogRef.Partners</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>Agreement</name>
   <type>
    <types>CatalogRef.Agreements</types>
   </type>
  </attributes>
  <attributes>
   <name>CalculationType</name>
   <type>
    <types>CatalogRef.SalaryCalculationType</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>Currencies</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>CurrencyFrom</name>
   <type>
    <types>CatalogRef.Currencies</types>
   </type>
  </attributes>
  <attributes>
   <name>Rate</name>
   <type>
    <types>DefinedType.typeCurrencyRate</types>
   </type>
  </attributes>
  <attributes>
   <name>ReverseRate</name>
   <type>
    <types>DefinedType.typeCurrencyRate</types>
   </type>
  </attributes>
  <attributes>
   <name>ShowReverseRate</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Multiplicity</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>10</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>MovementType</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>IsFixed</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>SalaryTaxList</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Employee</name>
   <type>
    <types>CatalogRef.Partners</types>
   </type>
  </attributes>
  <attributes>
   <name>Tax</name>
   <type>
    <types>CatalogRef.Taxes</types>
   </type>
  </attributes>
  <attributes>
   <name>ExpenseType</name>
   <type>
    <types>CatalogRef.ExpenseAndRevenueTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ProfitLossCenter</name>
   <type>
    <types>CatalogRef.BusinessUnits</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>CalculationType</name>
   <type>
    <types>CatalogRef.SalaryCalculationType</types>
   </type>
  </attributes>
  <attributes>
   <name>Agreement</name>
   <type>
    <types>CatalogRef.Agreements</types>
   </type>
  </attributes>
  <attributes>
   <name>TakeAccountFromTaxes</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Partner</name>
   <type>
    <types>CatalogRef.Partners</types>
   </type>
  </attributes>
  <attributes>
   <name>LegalName</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Document>

IRP/src/Documents/Payroll/ManagerModule.bsl
#Region PrintForm

Function GetPrintForm(Ref, PrintFormName, AddInfo = Undefined) Export
	Return Undefined;
EndFunction

#EndRegion

#Region Posting

Function PostingGetDocumentDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	Tables = New Structure();
	QueryArray = GetQueryTextsSecondaryTables();
	Parameters.Insert("QueryParameters", GetAdditionalQueryParameters(Ref));
	PostingServer.ExecuteQuery(Ref, QueryArray, Parameters);
	Return Tables;
EndFunction

Function PostingGetLockDataSource(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	DataMapWithLockFields = New Map();
	Return DataMapWithLockFields;
EndFunction

Procedure PostingCheckBeforeWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	Tables = Parameters.DocumentDataTables;
	QueryArray = GetQueryTextsMasterTables();
	PostingServer.SetRegisters(Tables, Ref);
	
	Tables.R5022T_Expenses.Columns.Add("Key", Metadata.DefinedTypes.typeRowID.Type);
	Tables.R5021T_Revenues.Columns.Add("Key", Metadata.DefinedTypes.typeRowID.Type);
	Tables.R9510B_SalaryPayment.Columns.Add("Key", Metadata.DefinedTypes.typeRowID.Type);
	Tables.R3027B_EmployeeCashAdvance.Columns.Add("Key", Metadata.DefinedTypes.typeRowID.Type);
	
	PostingServer.FillPostingTables(Tables, Ref, QueryArray, Parameters);
EndProcedure

Function PostingGetPostingDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	PostingDataTables = New Map();
	PostingServer.SetPostingDataTables(PostingDataTables, Parameters);
	Return PostingDataTables;
EndFunction

Procedure PostingCheckAfterWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	CheckAfterWrite(Ref, Cancel, Parameters, AddInfo);
EndProcedure

#EndRegion

#Region Undoposting

Function UndopostingGetDocumentDataTables(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return PostingGetDocumentDataTables(Ref, Cancel, Undefined, Parameters, AddInfo);
EndFunction

Function UndopostingGetLockDataSource(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	DataMapWithLockFields = New Map();
	Return DataMapWithLockFields;
EndFunction

Procedure UndopostingCheckBeforeWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	QueryArray = GetQueryTextsMasterTables();
	PostingServer.ExecuteQuery(Ref, QueryArray, Parameters);
EndProcedure

Procedure UndopostingCheckAfterWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Parameters.Insert("Unposting", True);
	CheckAfterWrite(Ref, Cancel, Parameters, AddInfo);
EndProcedure

#EndRegion

#Region CheckAfterWrite

Procedure CheckAfterWrite(Ref, Cancel, Parameters, AddInfo = Undefined)
	Return;
EndProcedure

#EndRegion

#Region Posting_Info

Function GetInformationAboutMovements(Ref) Export
	Str = New Structure;
	Str.Insert("QueryParameters", GetAdditionalQueryParameters(Ref));
	Str.Insert("QueryTextsMasterTables", GetQueryTextsMasterTables());
	Str.Insert("QueryTextsSecondaryTables", GetQueryTextsSecondaryTables());
	Return Str;
EndFunction

Function GetAdditionalQueryParameters(Ref)
	StrParams = New Structure();
	StrParams.Insert("Ref", Ref);
	Return StrParams;
EndFunction

#EndRegion

#Region Posting_MainTables

#EndRegion

#Region Posting_SourceTable


#EndRegion

#Region AccessObject

// Get access key.
// 
// Parameters:
//  Obj - DocumentObjectDocumentName -
// 
// Returns:
//  Map
Function GetAccessKey(Obj) Export
	AccessKeyMap = New Map;
	AccessKeyMap.Insert("Company", Obj.Company);
	AccessKeyMap.Insert("Branch", Obj.Branch);
	Return AccessKeyMap;
EndFunction

#EndRegion


Function GetQueryTextsSecondaryTables()
	QueryArray = New Array();
	QueryArray.Add(AccrualList());
	QueryArray.Add(DeductionList());
	QueryArray.Add(CashAdvanceDeductionList());
	Return QueryArray;
EndFunction

Function GetQueryTextsMasterTables()
	QueryArray = New Array();
	QueryArray.Add(R5022T_Expenses());
	QueryArray.Add(R5021T_Revenues());
	QueryArray.Add(R9510B_SalaryPayment());
	QueryArray.Add(R3027B_EmployeeCashAdvance());
	Return QueryArray;
EndFunction

Function AccrualList()
	Return
	"SELECT
	|	AccrualList.Key,
	|	AccrualList.Ref.Date AS Period,
	|	AccrualList.Ref.Company AS Company,
	|	AccrualList.Ref.Branch AS Branch,
	|	AccrualList.Ref.Currency AS Currency,
	|	AccrualList.Ref.PaymentPeriod AS PaymentPeriod,
	|	AccrualList.Employee,
	|	AccrualList.ExpenseType,
	|	AccrualList.ProfitLossCenter,
	|	AccrualList.Amount
	|INTO AccrualList
	|FROM
	|	Document.Payroll.AccrualList AS AccrualList
	|WHERE
	|	AccrualList.Ref = &Ref";
EndFunction

Function DeductionList()
	Return
		"SELECT
		|	DeductionList.Key,
		|	DeductionList.Ref.Date AS Period,
		|	DeductionList.Ref.Company AS Company,
		|	DeductionList.Ref.Branch AS Branch,
		|	DeductionList.Ref.Currency AS Currency,
		|	DeductionList.Ref.PaymentPeriod AS PaymentPeriod,
		|	DeductionList.Employee,
		|	DeductionList.ExpenseType,
		|	DeductionList.ProfitLossCenter,
		|	DeductionList.IsRevenue,
		|	DeductionList.Amount
		|INTO DeductionList
		|FROM
		|	Document.Payroll.DeductionList AS DeductionList
		|WHERE
		|	DeductionList.Ref = &Ref";
EndFunction

Function CashAdvanceDeductionList()
	Return
		"SELECT
		|	CashAdvanceDeductionList.Key,
		|	CashAdvanceDeductionList.Ref.Date AS Period,
		|	CashAdvanceDeductionList.Ref.Company AS Company,
		|	CashAdvanceDeductionList.Ref.Branch AS Branch,
		|	CashAdvanceDeductionList.Ref.Currency AS Currency,
		|	CashAdvanceDeductionList.Ref.PaymentPeriod AS PaymentPeriod,
		|	CashAdvanceDeductionList.Employee,
		|	CashAdvanceDeductionList.Amount
		|INTO CashAdvanceDeductionList
		|FROM
		|	Document.Payroll.CashAdvanceDeductionList AS CashAdvanceDeductionList
		|WHERE
		|	CashAdvanceDeductionList.Ref = &Ref";
EndFunction

Function R5022T_Expenses()
	Return
		"SELECT
		|	AccrualList.Period,
		|	AccrualList.Key,
		|	AccrualList.Company,
		|	AccrualList.Branch,
		|	AccrualList.Currency,
		|	AccrualList.ExpenseType,
		|	AccrualList.ProfitLossCenter,
		|	AccrualList.Amount AS Amount
		|INTO R5022T_Expenses
		|FROM
		|	AccrualList
		|WHERE
		|	TRUE
		|
		|UNION ALL
		|
		|SELECT
		|	DeductionList.Period,
		|	DeductionList.Key,
		|	DeductionList.Company,
		|	DeductionList.Branch,
		|	DeductionList.Currency,
		|	DeductionList.ExpenseType,
		|	DeductionList.ProfitLossCenter,
		|	-DeductionList.Amount AS Amount
		|FROM
		|	DeductionList
		|WHERE
		|	NOT DeductionList.IsRevenue";
EndFunction

Function R5021T_Revenues()
	Return
		"SELECT
		|	DeductionList.Period,
		|	DeductionList.Key,
		|	DeductionList.Company,
		|	DeductionList.Branch,
		|	DeductionList.Currency,
		|	DeductionList.ExpenseType AS RevenueType,
		|	DeductionList.ProfitLossCenter,
		|	DeductionList.Amount AS Amount
		|INTO R5021T_Revenues
		|FROM
		|	DeductionList
		|WHERE
		|	DeductionList.IsRevenue";
EndFunction
	
Function R9510B_SalaryPayment()
	Return
		"SELECT
		|	VALUE(AccumulationRecordType.Receipt) AS RecordType,
		|	AccrualList.Period,
		|	AccrualList.Key,
		|	AccrualList.Company,
		|	AccrualList.Branch,
		|	AccrualList.Currency,
		|	AccrualList.PaymentPeriod,
		|	AccrualList.Employee,
		|	AccrualList.Amount
		|INTO R9510B_SalaryPayment
		|FROM
		|	AccrualList
		|WHERE
		|	TRUE
		|
		|UNION ALL
		|
		|SELECT
		|	VALUE(AccumulationRecordType.Expense),
		|	DeductionList.Period,
		|	DeductionList.Key,
		|	DeductionList.Company,
		|	DeductionList.Branch,
		|	DeductionList.Currency,
		|	DeductionList.PaymentPeriod,
		|	DeductionList.Employee,
		|	DeductionList.Amount
		|FROM
		|	DeductionList
		|WHERE
		|	TRUE
		|
		|UNION ALL
		|
		|SELECT
		|	VALUE(AccumulationRecordType.Expense),
		|	CashAdvanceDeductionList.Period,
		|	CashAdvanceDeductionList.Key,
		|	CashAdvanceDeductionList.Company,
		|	CashAdvanceDeductionList.Branch,
		|	CashAdvanceDeductionList.Currency,
		|	CashAdvanceDeductionList.PaymentPeriod,
		|	CashAdvanceDeductionList.Employee,
		|	CashAdvanceDeductionList.Amount
		|FROM
		|	CashAdvanceDeductionList
		|WHERE
		|	TRUE";
EndFunction

Function R3027B_EmployeeCashAdvance()
	Return
		"SELECT
		|	VALUE(AccumulationRecordType.Expense) AS RecordType,
		|	CashAdvanceDeductionList.Period,
		|	CashAdvanceDeductionList.Key,
		|	CashAdvanceDeductionList.Company,
		|	CashAdvanceDeductionList.Branch,
		|	CashAdvanceDeductionList.Currency,
		|	CashAdvanceDeductionList.Employee AS Partner,
		|	CashAdvanceDeductionList.Amount
		|INTO R3027B_EmployeeCashAdvance
		|FROM
		|	CashAdvanceDeductionList
		|WHERE
		|	TRUE";
EndFunction
